Repository: SlippinDylan/Techne
Catalog: App/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# 导出当前项目与命令配置，或从备份文件恢复本地数据。
source: Export current projects and command configurations, or restore local data from a backup.
zh_hans: 导出当前项目与命令配置，或从备份文件恢复本地数据。
zh_hant: 匯出目前專案與指令設定，或從備份檔案還原本機資料。

# 就绪
source: Ready
zh_hans: 就绪
zh_hant: 就绪

# 工作目录有 %lld 个未提交的文件
source: The working directory has %lld uncommitted files
zh_hans: 工作目录有 %lld 个未提交的文件
zh_hant: 工作目錄有 %lld 個未提交的檔案

# 已添加项目
source: Added Projects
zh_hans: 已添加项目
zh_hant: 已新增專案

# 已选择 %lld 条
source: %lld selected
zh_hans: 已选择 %lld 条
zh_hant: 已選擇 %lld 筆

# 序列号: %@
source: Serial Number: %@
zh_hans: 序列号: %@
zh_hant: 序號: %@

# 应用状态数据存放在 ~/Library/Application Support/studio.slippindylan.Techne/ 目录下。
source: Application state data is stored in ~/Library/Application Support/studio.slippindylan.Techne/.
zh_hans: 应用状态数据存放在 ~/Library/Application Support/studio.slippindylan.Techne/ 目录下。
zh_hant: 應用程式状態資料存放在 ~/Library/Application Support/studio.slippindylan.Techne/ 目錄下。

# 应用语言
source: App Language
zh_hans: 应用语言
zh_hant: 應用程式語言

# 开发服务与实例
source: Development Services & Instances
zh_hans: 开发服务与实例
zh_hant: 開發服務與實例

# 开机自动启动
source: Launch at Login
zh_hans: 开机自动启动
zh_hant: 開機自動啟動

# 当前 Mac 上未检测到可启动的受支持浏览器
source: No supported launchable browsers were found on this Mac.
zh_hans: 当前 Mac 上未检测到可启动的受支持浏览器
zh_hant: 目前 Mac 上未偵測到可啟動的受支援瀏覽器

# 当前启动模式
source: Current Launch Mode
zh_hans: 当前启动模式
zh_hant: 目前啟動模式

# 当前项目卡片展示的是项目自己的命令快照。
source: This project card shows the project's own command snapshot.
zh_hans: 当前项目卡片展示的是项目自己的命令快照。
zh_hant: 目前專案卡片展示的是專案自己的指令快照。

# 微信小程序构建
source: WeChat Mini Program Build
zh_hans: 微信小程序构建
zh_hant: 微信小程式建置

# 微信工具
source: WeChat DevTools
zh_hans: 微信工具
zh_hant: 微信工具

# 总日志数
source: Total Logs
zh_hans: 总日志数
zh_hant: 總日誌數

# 总是安装
source: Always Install
zh_hans: 总是安装
zh_hant: 一律安裝

# 成功
source: Success
zh_hans: 成功
zh_hant: 成功

# 成功启动浏览器 (PID: %lld)
source: Browser started successfully (PID: %lld)
zh_hans: 成功启动浏览器 (PID: %lld)
zh_hant: 成功啟動瀏覽器 (PID: %lld)

# 成功启动浏览器实例 (PID: %lld)
source: Browser instance started successfully (PID: %lld)
zh_hans: 成功启动浏览器实例 (PID: %lld)
zh_hant: 成功啟動瀏覽器實例 (PID: %lld)

# 我的项目
source: My Projects
zh_hans: 我的项目
zh_hant: 我的專案

# 打开数据目录
source: Open Data Folder
zh_hans: 打开数据目录
zh_hant: 開啟資料目錄

# 搜索日志...
source: Search Logs...
zh_hans: 搜索日志...
zh_hant: 搜尋日誌...

# 操作日志
source: Activity Log
zh_hans: 操作日志
zh_hant: 操作日誌

# 放弃更改
source: Discard Changes
zh_hans: 放弃更改
zh_hant: 捨棄變更

# 数据与备份
source: Data & Backup
zh_hans: 数据与备份
zh_hant: 資料與備份

# 新建浏览器实例
source: New Browser Instance
zh_hans: 新建浏览器实例
zh_hant: 新建瀏覽器實例

# 无法添加项目
source: Unable to Add Project
zh_hans: 无法添加项目
zh_hant: 無法新增專案

# 日志
source: Logs
zh_hans: 日志
zh_hant: 日誌

# 显示或隐藏日志
source: Show or Hide Logs
zh_hans: 显示或隐藏日志
zh_hant: 顯示或隱藏日誌

# 暂无小程序项目
source: No Mini Program Projects
zh_hans: 暂无小程序项目
zh_hant: 暂无小程式專案

# 暂无开发项目
source: No Development Projects
zh_hans: 暂无开发项目
zh_hant: 暂无開發專案

# 更新配置失败: %@
source: Failed to update configuration: %@
zh_hans: 更新配置失败: %@
zh_hant: 更新設定失敗: %@

# 未提交变更
source: Uncommitted Changes
zh_hans: 未提交变更
zh_hant: 未提交變更

# 未检测到本地分支
source: No local branches found
zh_hans: 未检测到本地分支
zh_hant: 未偵測到本機分支

# 未检测到设备，请检查 USB 连接并确保开启开发者模式
source: No device detected. Check the USB connection and make sure Developer Mode is enabled.
zh_hans: 未检测到设备，请检查 USB 连接并确保开启开发者模式
zh_hant: 未偵測到裝置，請檢查 USB 連線並確認開啟開發者模式

# 未知分支
source: Unknown Branch
zh_hans: 未知分支
zh_hant: 未知分支

# 未配置
source: Not Configured
zh_hans: 未配置
zh_hant: 未設定

# 构建
source: Build
zh_hans: 构建
zh_hant: 建置

# 构建命令
source: Build Command
zh_hans: 构建命令
zh_hant: 建置指令

# 查看和筛选应用操作日志
source: View and filter application activity logs
zh_hans: 查看和筛选应用操作日志
zh_hant: 檢視與篩選應用程式操作日誌

# 查看版本信息并检查更新
source: View version information and check for updates
zh_hans: 查看版本信息并检查更新
zh_hant: 檢視版本資訊並檢查更新

# 检查更新…
source: Check for Updates…
zh_hans: 检查更新…
zh_hant: 檢查更新…

# 正在加载分支...
source: Loading branches...
zh_hans: 正在加载分支...
zh_hant: 正在加載分支...

# 正在启动…
source: Launching…
zh_hans: 正在启动…
zh_hant: 正在啟動…

# 正在强制激活应用...
source: Force-launching the app...
zh_hans: 正在强制激活应用...
zh_hant: 正在強制啟動應用程式...

# 正在强力清除旧版本...
source: Force-removing the previous version...
zh_hans: 正在强力清除旧版本...
zh_hant: 正在強制移除舊版本...

# 正在执行深度安装 (-r -d -t)...
source: Performing deep installation (-r -d -t)...
zh_hans: 正在执行深度安装 (-r -d -t)...
zh_hant: 正在執行深度安裝 (-r -d -t)...

# 正在解析 APK 包名...
source: Parsing APK package name...
zh_hans: 正在解析 APK 包名...
zh_hant: 正在解析 APK 包名...

# 没有命令配置
source: No Command Configurations
zh_hans: 没有命令配置
zh_hant: 沒有指令設定

# 没有运行中的浏览器实例
source: No Running Browser Instances
zh_hans: 没有运行中的浏览器实例
zh_hant: 沒有執行中的瀏覽器實例

# 浏览器
source: Browser
zh_hans: 浏览器
zh_hant: 瀏覽器

# 添加
source: Add
zh_hans: 添加
zh_hant: 新增

# 添加后会根据项目类型、lockfile 和 package.json scripts 自动生成完整的项目命令快照。
source: After adding, a complete command snapshot is generated from the project type, lockfile, and package.json scripts.
zh_hans: 添加后会根据项目类型、lockfile 和 package.json scripts 自动生成完整的项目命令快照。
zh_hant: 新增後會根據專案類型、lockfile 與 package.json scripts 自動生成完整的專案指令快照。

# 添加命令配置
source: Add Command Configuration
zh_hans: 添加命令配置
zh_hant: 新增指令設定

# 添加小程序项目
source: Add Mini Program Project
zh_hans: 添加小程序项目
zh_hant: 新增小程式專案

# 添加开发项目
source: Add Development Project
zh_hans: 添加开发项目
zh_hant: 新增開發專案

# 添加服务
source: Add Service
zh_hans: 添加服务
zh_hant: 新增服務

# 添加项目
source: Add Project
zh_hans: 添加项目
zh_hant: 新增專案

# 清理
source: Clean
zh_hans: 清理
zh_hant: 清理

# 清理命令
source: Clean Command
zh_hans: 清理命令
zh_hant: 清理指令

# 清理缓存命令
source: Clean Cache Command
zh_hans: 清理缓存命令
zh_hant: 清理快取指令

# 清空日志
source: Clear Logs
zh_hans: 清空日志
zh_hant: 清空日誌

# 清除日志
source: Clear Logs
zh_hans: 清除日志
zh_hant: 清除日誌

# 点击"添加配置"创建新的命令配置模板
source: Click “Add Configuration” to create a command configuration template
zh_hans: 点击"添加配置"创建新的命令配置模板
zh_hant: 按一下"新增設定"建立新的指令設定模板

# 点击右上角 + 按钮添加开发项目
source: Click the + button in the upper-right corner to add a development project
zh_hans: 点击右上角 + 按钮添加开发项目
zh_hant: 按一下右上角 + 按鈕新增開發專案

# 点击右上角 + 按钮添加微信小程序项目
source: Click the + button in the upper-right corner to add a WeChat Mini Program project
zh_hans: 点击右上角 + 按钮添加微信小程序项目
zh_hant: 按一下右上角 + 按鈕新增微信小程式專案

# 点击选择或拖入 APK 文件...
source: Click to choose or drop an APK file...
zh_hans: 点击选择或拖入 APK 文件...
zh_hant: 按一下選擇或拖入 APK 檔案...

# 版本 %@
source: Version %@
zh_hans: 版本 %@
zh_hant: 版本 %@

# 用于丢弃工作区的所有更改
source: Used to discard all workspace changes
zh_hans: 用于丢弃工作区的所有更改
zh_hant: 用於捨棄工作區的所有變更

# 用于停止服务器（可选）
source: Used to stop the server (optional)
zh_hans: 用于停止服务器（可选）
zh_hant: 用於停止伺服器（可選）

# 用于启动开发服务器
source: Used to start the development server
zh_hans: 用于启动开发服务器
zh_hant: 用於啟動開發伺服器

# 用于安装项目依赖
source: Used to install project dependencies
zh_hans: 用于安装项目依赖
zh_hant: 用於安裝專案相依套件

# 用于构建生产版本
source: Used to build the production version
zh_hans: 用于构建生产版本
zh_hant: 用於建置生產版本

# 用于清除编译产物和缓存
source: Used to remove build artifacts and caches
zh_hans: 用于清除编译产物和缓存
zh_hant: 用於清除編譯產物與快取

# 知道了
source: OK
zh_hans: 知道了
zh_hant: 知道了

# 确定
source: OK
zh_hans: 确定
zh_hant: 確定

# 确定要从列表中移除"%@"吗？这不会删除项目文件。
source: Remove “%@” from the list? Project files will not be deleted.
zh_hans: 确定要从列表中移除"%@"吗？这不会删除项目文件。
zh_hant: 確定要從列表中移除"%@"嗎？這不會刪除專案檔案。

# 确定要关闭所有 %lld 个浏览器实例吗？此操作不可撤销。
source: Close all %lld browser instances? This action cannot be undone.
zh_hans: 确定要关闭所有 %lld 个浏览器实例吗？此操作不可撤销。
zh_hant: 確定要關閉所有 %lld 個瀏覽器實例嗎？此操作無法復原。

# 确定要关闭所有运行中的本地服务吗？
source: Close all running local services?
zh_hans: 确定要关闭所有运行中的本地服务吗？
zh_hant: 確定要關閉所有執行中的本機服務嗎？

# 确定要删除配置 "%@" 吗？此操作不可撤销。
source: Delete configuration “%@”? This action cannot be undone.
zh_hans: 确定要删除配置 "%@" 吗？此操作不可撤销。
zh_hant: 確定要刪除設定 "%@" 嗎？此操作無法復原。

# 确定要放弃所有未提交的更改吗？此操作不可撤销。
source: Discard all uncommitted changes? This action cannot be undone.
zh_hans: 确定要放弃所有未提交的更改吗？此操作不可撤销。
zh_hant: 確定要捨棄所有未提交的變更嗎？此操作無法復原。

# 确定要移除项目吗？
source: Remove Project?
zh_hans: 确定要移除项目吗？
zh_hant: 確定要移除專案嗎？

# 确认关闭所有实例
source: Confirm Close All Instances
zh_hans: 确认关闭所有实例
zh_hant: 確認關閉所有實例

# 确认关闭所有服务器
source: Confirm Close All Servers
zh_hans: 确认关闭所有服务器
zh_hant: 確認關閉所有伺服器

# 确认删除
source: Confirm Delete
zh_hans: 确认删除
zh_hant: 確認刪除

# 确认放弃更改
source: Confirm Discard Changes
zh_hans: 确认放弃更改
zh_hant: 確認捨棄變更

# 确认移除项目
source: Confirm Remove Project
zh_hans: 确认移除项目
zh_hant: 確認移除專案

# 移除
source: Remove
zh_hans: 移除
zh_hant: 移除

# 移除项目
source: Remove Project
zh_hans: 移除项目
zh_hant: 移除專案

# 稍后
source: Later
zh_hans: 稍后
zh_hant: 稍後

# 立即部署
source: Deploy Now
zh_hans: 立即部署
zh_hant: 立即部署

# 端口: %lld
source: Port: %lld
zh_hans: 端口: %lld
zh_hant: 連接埠: %lld

# 等待任务启动...
source: Waiting for the task to start...
zh_hans: 等待任务启动...
zh_hant: 等待工作啟動...

# 管理启动选项、数据与备份
source: Manage launch options, data, and backups
zh_hans: 管理启动选项、数据与备份
zh_hant: 管理啟動選項、資料與備份

# 管理微信小程序项目，快速切换分支并构建
source: Manage WeChat Mini Program projects, switch branches, and build quickly
zh_hans: 管理微信小程序项目，快速切换分支并构建
zh_hant: 管理微信小程式專案，快速切換分支並建置

# 终端
source: Terminal
zh_hans: 终端
zh_hant: 終端機

# 统一管理开发服务和关联的浏览器实例
source: Manage development services and associated browser instances
zh_hans: 统一管理开发服务和关联的浏览器实例
zh_hant: 統一管理開發服務與相關的瀏覽器實例

# 编译
source: Build
zh_hans: 编译
zh_hant: 編譯

# 编译命令
source: Build Command
zh_hans: 编译命令
zh_hant: 編譯指令

# 编辑命令配置
source: Edit Command Configuration
zh_hans: 编辑命令配置
zh_hant: 編輯指令設定

# 编辑配置
source: Edit Configuration
zh_hans: 编辑配置
zh_hant: 編輯設定

# 缺失时安装
source: Install if Missing
zh_hans: 缺失时安装
zh_hant: 缺失時安裝

# 自定义命令
source: Custom Commands
zh_hans: 自定义命令
zh_hant: 自定義指令

# 警告
source: Warning
zh_hans: 警告
zh_hant: 警告

# 设备状态
source: Device Status
zh_hans: 设备状态
zh_hant: 裝置状態

# 设置
source: Settings
zh_hans: 设置
zh_hant: 設定

# 设置…
source: Settings…
zh_hans: 设置…
zh_hant: 設定…

# 语言更改将在重新启动后生效
source: Restart to Apply Language Change
zh_hans: 语言更改将在重新启动后生效
zh_hant: 語言變更將在重新啟動後生效

# 请输入项目路径
source: Enter project path
zh_hans: 请输入项目路径
zh_hant: 請输入專案路徑

# 调试端口: %lld
source: Debug Port: %lld
zh_hans: 调试端口: %lld
zh_hant: 偵錯連接埠: %lld

# 跟随系统
source: Follow System
zh_hans: 跟随系统
zh_hant: 跟隨系統

# 运行中
source: Running
zh_hans: 运行中
zh_hant: 執行中

# 运行中的实例
source: Running Instances
zh_hans: 运行中的实例
zh_hant: 執行中的實例

# 运行中的浏览器实例
source: Running Browser Instances
zh_hans: 运行中的浏览器实例
zh_hant: 執行中的瀏覽器實例

# 运行中项目
source: Running Projects
zh_hans: 运行中项目
zh_hant: 執行中專案

# 退出 Techne
source: Quit Techne
zh_hans: 退出 Techne
zh_hant: 退出 Techne

# 选择浏览器
source: Choose Browser
zh_hans: 选择浏览器
zh_hant: 選擇瀏覽器

# 通常留空，使用 kill 命令
source: Usually left blank; uses the kill command
zh_hans: 通常留空，使用 kill 命令
zh_hant: 通常留空，使用 kill 指令

# 通用
source: General
zh_hans: 通用
zh_hant: 通用

# 通过 ADB 快速部署 APK 到 Android 设备
source: Quickly deploy APKs to Android devices via ADB
zh_hans: 通过 ADB 快速部署 APK 到 Android 设备
zh_hant: 通過 ADB 快速部署 APK 到 Android 裝置

# 部署失败: %@
source: Deployment failed: %@
zh_hans: 部署失败: %@
zh_hant: 部署失敗: %@

# 部署成功 (已校验物理更新)
source: Deployment succeeded (physical update verified)
zh_hans: 部署成功 (已校验物理更新)
zh_hant: 部署成功 (已校验實際更新)

# 配置名称
source: Configuration Name
zh_hans: 配置名称
zh_hant: 設定名稱

# 重建微信文件监听
source: Rebuild WeChat File Watcher
zh_hans: 重建微信文件监听
zh_hant: 重建微信檔案監看

# 重新启动
source: Restart
zh_hans: 重新启动
zh_hant: 重新啟動

# 重置
source: Reset
zh_hans: 重置
zh_hant: 重置

# 错误
source: Error
zh_hans: 错误
zh_hant: 錯誤

# 项目 '%@' 将从列表中移除，但不会删除磁盘上的文件。
source: Project “%@” will be removed from the list, but its files on disk will not be deleted.
zh_hans: 项目 '%@' 将从列表中移除，但不会删除磁盘上的文件。
zh_hant: 專案 '%@' 將從列表中移除，但不會刪除磁碟上的檔案。

# 项目类型
source: Project Type
zh_hans: 项目类型
zh_hant: 專案類型

# 项目路径
source: Project Path
zh_hans: 项目路径
zh_hant: 專案路徑

# 默认
source: Default
zh_hans: 默认
zh_hant: 預設

# 默认浏览器
source: Default Browser
zh_hans: 默认浏览器
zh_hant: 預設瀏覽器
